Revit 2027 API
TextBoxData Class
This class contains information necessary to construct a text box in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.TextBoxData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextBoxData : RibbonItemData
Public Class TextBoxData
	Inherits RibbonItemData
public ref class TextBoxData : public RibbonItemData
type TextBoxData =
    class
        inherit RibbonItemData
    end
The TextBoxData type exposes the following members.
Constructors
Name | Description
TextBoxData | Constructs a new instance of TextBoxData.
Top
Properties
Name | Description
Image | The image of the TextBox.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItemData)
Name |  The internal name of the item.
(Inherited from ItemData)
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItemData)
Top
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
(Inherited from RibbonItemData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
(Inherited from RibbonItemData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace